cases/TGV/RKSymFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pCorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pCorrFinal
    {
        $pCorr;
        relTol          0;
    }
}

RungeKutta
{
    scheme          BackwardEuler;
    nOuter          1;
    nInner          2;
    pnPredCoef      1;
    pRefPoint       (3.141528 3.141528 0);
    pRefValue       0;
}


// ************************************************************************* //
